# Base dependencies required for deploying on macOS. Defined like this because Homebrew
# is a requirement on macOS.

# Standard Homebrew taps
tap "homebrew/bundle"
tap "homebrew/autoupdate"
tap "homebrew/services"

if OS.mac?
  brew "coreutils"
  brew "findutils"
  brew "m-cli"
end
brew "age"
# Ensure macOS Bash gets upgraded to 5+
brew "bash"
brew "expect"
brew "ffmpeg"
brew "fzf"
brew "gawk"
brew "git-delta"
brew "glow"
brew "gnupg"
brew "go"
brew "gsed"
brew "gum"
brew "htmlq"
brew "jq"
brew "mas"
brew "mediainfo"
brew "moreutils"
brew "m4"
brew "node"
brew "openssh"
brew "pinentry-mac"
brew "pipx"
brew "pkg-config"
brew "progress"
brew "python@3.11"
brew "python@3.12"
brew "ruby"
brew "rust"
tap "go-task/tap"
brew "go-task/tap/go-task"
brew "volta"
brew "yarn"
brew "yq"
brew "zx"
cask "docker"
cask "java@beta" unless system "/usr/libexec/java_home --failfast"
cask "macfuse"
