# Base dependencies required for deploying on macOS. Defined like this because Homebrew
# is a requirement on macOS.

# Standard Homebrew taps
tap "homebrew/cask-versions" # Initially added to support "visual-studio" cask
tap "homebrew/core"
tap "homebrew/bundle"

if OS.mac?
  brew "coreutils"
  brew "findutils"
  brew "m-cli"
end
brew "age"
# Ensure macOS Bash gets upgraded to 5+
brew "bash"
brew "expect"
brew "gawk"
brew "git-delta"
brew "glow"
brew "gnupg"
brew "go"
brew "gsed"
brew "gum"
brew "htmlq"
brew "jq"
brew "node"
brew "progress"
brew "python@3.11"
tap "go-task/tap"
brew "go-task/tap/go-task"
brew "volta"
brew "yq"
brew "zx"
