
# @brew [asdf](https://github.com/asdf-vm/asdf) - Version manager with support for many languages
brew "asdf"
# @brew [bat](https://github.com/sharkdp/bat) - Clone of cat with syntax highlighting and Git integration
brew "bat"
# @brew [direnv](https://github.com/direnv/direnv) - Loads and unloads environment variables based on the directory you are in
brew "direnv"
# @brew [docker](https://www.docker.com/) - A powerful toolchain for developing containerized applications
if OS.linux?
    brew "docker"
end
# @brew [exa](https://github.com/ogham/exa) - Modern replacement for ls
brew "exa"
# @brew [ffsend](https://github.com/timvisee/ffsend) - Fully featured Firefox Send client that makes sharing files easy
brew "ffsend"
# @brew [fzf](https://github.com/junegunn/fzf) - Command-line fuzzy finder that integrates with many tools
brew "fzf"
# @brew [go](https://go.dev) - Open source programming language
brew "go"
# @brew [glances](https://github.com/nicolargo/glances) - Better replacement for htop
brew "glances"
# @brew [jq](https://stedolan.github.io/jq/) - Lightweight and flexible command-line JSON processor
brew "jq"
# @brew [mcfly](https://github.com/cantino/mcfly) - Terminal history navigator accessible via CTRL+R
tap "cantino/mcfly"
brew "cantino/mcfly/mcfly"
# @brew [mc](https://github.com/minio/mc) - Replacement for ls, cp and other commands that are compatible with file-system-mounted S3 buckets
tap "minio/stable"
brew "minio/stable/mc"
# @brew [nnn](https://github.com/jarun/nnn) - A more interactive version of ls
brew "nnn"
# @brew [node](https://nodejs.org/) - A JavaScript engine, based on the ultra fast V8-engine
brew "node"
# @brew [ots](https://ots.sniptt.com) - Share end-to-end encrypted secrets with others via a one-time URL
brew "ots"
# @brew [oq](https://blacksmoke16.github.io/oq) - Performant, and portable jq wrapper that supports formats other than JSON
brew "oq"
# @brew [poetry](https://python-poetry.org/) - A Python project package management tool and more
brew "poetry"
# @brew [python](https://www.python.org/) - Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# @brew [task](https://github.com/go-task/homebrew-tap) - A parallel task runner
tap "go-task/tap"
brew "go-task/tap/go-task"
# @brew [yarn](https://yarnpkg.com/) - JavaScript package manager from Facebook
brew "yarn"
# @brew [yq](https://github.com/mikefarah/yq) - Process and manipulate YAML documents
brew "yq"
# @brew [coreutils](https://www.gnu.org/software/coreutils) - A suite of basic UNIX tools published to improve compatibility between Linux and macOS scripts
if OS.mac?
    brew "coreutils"
end

# Homebrew Casks (only available on macOS)
# e.g. `brew install --cask <program>`
# @cask [altair](https://altair.sirmuel.design/) - GraphQL GUI client
cask "altair"
# @cask [android-studio](https://developer.android.com/studio) - Android Studio is used to build Android apps and includes the SDK tool manager
cask "android-studio"
# @cask [balenaetcher](https://balena.io/etcher) - Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# @cask [bitwarden](https://bitwarden.com/) - Desktop client for BitWarden
cask "bitwarden"
# @cask [docker](https://docker.com) - The desktop GUI for Docker, a virtualization platform for containers and microservices
cask "docker"
# @cask [firefox](https://www.mozilla.org/firefox/) - A popular web browser
cask "firefox"
# @cask [gimp](https://www.gimp.org/) - Free and open-source image editor
cask "gimp"
# @cask [google-chrome](https://www.google.com/chrome/) - Sandbox-based web browser published by Google
cask "google-chrome"
# @cask [gcloud](https://cloud.google.com/sdk/gcloud) - The official Google Cloud Platform SDK CLI tool
cask "google-cloud-sdk"
# @cask [java](https://www.java.com/en/) - Libraries required for running and developing Java applications
cask "java" unless system "/usr/libexec/java_home --failfast"
# @cask [lens](https://k8slens.dev/) - An IDE for Kubernetes
cask "lens"
# @cask [microsoft-teams](https://teams.microsoft.com/downloads) - Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# @cask [macfuse](https://osxfuse.github.io/) - Extends macOS by adding support for user space file systems
cask "macfuse"
# @cask [postman](https://www.postman.com/) - Collaboration platform for API development
cask "postman"
# @cask [slack](https://slack.com/) - Team communication and collaboration software
cask "slack"
# @cask [skype](https://www.skype.com/) - Video chat, voice call, and instant messaging application
cask "skype"
# @cask [teamviewer](https://www.teamviewer.com/) - Remote access and connectivity software focused on security
cask "teamviewer"
# @cask [vagrant](https://www.vagrantup.com/) - Command-line, configuration-driven CLI for launching virtualization tools
cask "vagrant"
# @cask [virtualbox](https://www.virtualbox.org/) - A popular virtualization platform for virtual machines
cask "virtualbox"
# @cask [visual-studio-code](https://code.visualstudio.com/) - Open source code editor
cask "visual-studio-code"
# @cask [vmware-fusion](https://www.vmware.com/products/fusion.html) - Create, manage, and run virtual machines
cask "vmware-fusion"
# @cask [wireshark](https://www.wireshark.org) - Graphical network analyzer and capture tool
cask "wireshark"
