scoop bucket add main
# Missing ASDF
bat
bitwarden-cli
direnv
ffsend
fzf
jq
task
rga
ripgrep
delta
volta
yq
zoxide
restic
nmap
pnpm
rclone
cloudflared
croc
ctop
dasel
duf
fd
glow
gping
grex
gron
procs
peco
pup
fq
fselect
hexyl
hyperfine
jo
mkcert
sd
up
fx
aria2
chezmoi
cheat
cmake
difftastic
gitui
gomplate
gum
deno
sqlite
vault
dust
imagemagick
shellcheck
sops
watchexec
ntop
vim
etcd
wget
git-lfs

