act
appium
azure-cli
dive
docker-pushrm
exiftool
ffmpeg
gcloud
gh
gitlab-runner
gitleaks
glab
git-filter-repo
go
gradle
helm
htmlq
kubectx
mitmproxy
nomad
packer
pandoc
php
poetry
python
ruby
scrcpy
teleport
upx
watchman
waypoint
wkhtmltopdf
win32yank
yarn
